derived
(i.e
cybercrime
from
Договор.doc”
identities
PrayTime
SCR
14th
pernicious
builder
extends
Blackfly
CVE-2017_1882
industry
surely
respectively
format
NCSC
freelancers
(HTA)
APT-12
Prince
System32
sake
expected
transpiring
Kazuar
implemented
web-based
WannaCry
gigabytes
virtue
Array
implementing
EoP
CallMe
structure
ppt
thousand
reporting
cyber-attack
entertainment
executing
Enforcement
TVs
stay
machine
handful
Oilrig
outbreak
proof-of-concept
easy
Invoke-Obfuscation
booby-trapped
Financial
reappearance
controller
businesses
peak
Scali
repurposed
keyloggers
XREFs
Israelis
Day
tendency
Periscope
autonomous
SMS
weekdays
grounds
WhiteBear
(including
getting
Qakbot
watching
removing
firm
experimented
events
live
were
resellers
publications
spectrum
makeself
Frankfurt
LANDesk
clear
blend
nor
2fe01a04d6beef14555b2cf9a717615c)
masse
umbrella
beneath
Simplified
commodity
final
manipulation
dupe
first-hand
Israel
Devices
APT
Defence
Golang
believed
minimal
documentation
accountant
raise
shopping
Neutron
main
Honeycomb
virus
CVE-2015-8651
Monero
CONFUCIUS_B
contacts
damage
org
concentration
portable
Blackberry
young
disparate
long-term
begin
EternalRomance
campaigns
confirms
cryptcat
zone
reserved
becoming
hallmark
Department
claims
happen
infestations
fields
Machines
spike
location
Certain
button
People’s
CMD
(nearly
originally
information
stole
photos
highly-targeted
regularly
become
subscription
.WCRY
forensic
historical
XLS-withyourface
Sauron
really
yty
--besides
99
MiamiBeach”
sideload
distinguishable
xfs-disp.exe
'
Upon
Centrum
Apple-like
deleting
trys
VOHO
straight
final-stage
reusing
weaponizes
entered
(JS)
campaign-related
spokeswoman
TTPs
CD/DVDs
maritime
microphone
DDOS
broader
scripts)
cycles
supply-chain
translation
organization
.exe
friends
GetIpNetTable
destroying
EternalSynergy
Arabia
macro
#1:
reemerged
versatile
dollars
Order_2018.jar
(Backdoor.Filensfer)
operations
easier
unclear
iexplore.exe
decryptor
CONFUCIUS_A
my
inject
securities
SNEEPY
words
validator
(EQNEDT32)
FASTCash”
denial-of-service
Australian
near-year-old
strings
lends
Democratic
sharp
Angola
release
interactions
checking
TV
Aerospace
(Breakout2
Keeping
160
command-and-control
data-wiping
Wine
wealth
landscape
corporation
Ongoing
topic
disks
CVE-2014-6332
Report
long-standing
109.235.51.110
ELMER
Tehran
12)
bars
examples
popularity
Feodo
banking
APT-C-00
knew
stevemike-fireforce.info
generations
Ecuador
asset
DNS-based
holiday
disputed
oldest
30
indictment
GReAT
cable
state-sponsored
substances
emphasis
picked
FlawedAmmy
Coordination
hosts
recreating
phony
2018-10-23
enumerating
suite
isolated
alleged
Intel®
(C2)
verticals
Sensitive
memoranda
music
e.g.webmail.finance.gov.lb
rates
14:00
Agari
MegaFon
resurgence
China
mwapi32.dll
infestation
Moscow
iviewers.dll
NSA
speculates
Secondary
Russian-based
GameNet
Chinese-speaking
comprehensive
building
filesystem
incidents”
toolkits
Xagent.exe
self-propagated
(Virtual
tanks
Behzad
Poseidon
phishingThese
thwarting
robust
notification
Last
RemoteExec
we’ll
'Fine
civilian
Claudio
submissions
CVE-2018-8120
screen
neighboring
filters
Citizen
Helios
RAT”
Oilrig1
Vkontakte
converts
Versions
space
CVE-2015-1701
Another
protocol
shown
st07383.en17.docx
externally
displayed
plaintext
linked
purportedly
MUMMY
attack
(AIB)
MSS
WCry
modular
top
diplomats
Reputation
13th
manufactured
cipher
joined
consecutive
CVE-2016-0099
crypt
infamous
expiration
actor-created
Guardian
Bdo
developer
accessing
constructs
Venomous
characteristic
titles
GozNym
12th
dynamic-link
Visma
hack
Attack
2:
network-connected
BitPaymer/FriedEx
OS
related
OwaAuth
aligns
cement
Embedded
(s
Environment
EPS
WIZARD
than
corporations
translated
Kuwait
BITTER
Backdoor.APT.PittyTiger
post-2014
questions
MSR
self-extracting
temporary
Call
SMEP
Group’s
(Tor)
Admin
orange)
Advisor
lot
stories
side-loading
CVE-2019-1132
private
crafting
HTTPBrowser
UPS
Trojan.Kwampirs
experts
Omega
generating
serve
portal
microphones
obscurity
Escalation
escalates
preference
300kb+
indiscriminate
Lashkar-e-Taiba
Longhorn
materials
Stonedrill
tries
interdict
Kashmir
Yet
medicine
Twitter
identifies
countries
nickname
resource-intensive
percent
Resecurity
third-party
unleash
fails
1965
(IP)
Resistance
Execution
areas
audios
hat
destroyed
DPRK
enough
invitations
earnest
TEMP.Jumper
locate
deception
timing
Force
includes
52
mirrors
Adaptive
dissects
vector
indication
Usually
non-trivial
planning
Limor
Wild
LightNeuron
fit
Novetta’s
coming
tank
reiterates
KillDisk
SharePoint
DDNS
more
possibly
account
weapon
Silence
split
hence
.swf
Partners
CVE-2016-4171
posting
shim
generate
crimeware
fairly
segment
ordinary
silence
(RMT)
owner
DragonOK
Facebook
90%
powerful
copy
Butterfly
achieves
combat
BackgroundActive
contours
condition
colloquially
machine-learning
defence
behavior
resurfaced
described
AKA
Commodity
Thunderbird
theft
random
Friday
HTTP
Guatemala
outreach
(EDB)
kept
great
vulnerabilities
$200
Trojan.Nibatad
deterring
LSA
addressed
:
MobileOrder
(ASEAN)
acknowledged
convinced
LATAM
smart
drives
proximity
tactical
tested
discussing
中東呼吸器症候
pause
artifacts
website
DNSpionage
hosted
mid-2016
leaders
form
FFRAT
unpatched
geospatial
causing
combined
bills
protection
NewPosThings
Herzegovina
realization
sell
PLATINUM
French
picture
MAR
unusual
50
Script
grant
body
password
ISO
APT40
Brazil-based
CVE-2017-7269
tools—EternalRomance
Learning
Taking
multi-year
Community
correct
user’s
websites
8.t”
MS
permit
Backdoor.Win32.Agent.delp
Tofu
Saudi
communicates
abandoned
militarily
exhaustive
Wipbot
starts
small
Q1
64
Korea–related
(DPRK)
Internet
in-game
recipients
engaged
excessive
62%
(Backdoor.Doublepulsar)
U.S.-based
propagate
signed
Anti-Doping
Throughout
artificial
hosting
real
relationships
Dorsey
improving
Night
mount
Alibaba
eXecutive
belonging
miner
forth
sometimes
unauthenticated
Given
CVE-2016-0051
Assistant.exe”
Backdoor.Sorgu
SA
tool-marks
request)
APT12
Canada-targeted
freely
pivoted
utilize
case
Colombian
Analyst
on
copies
WikiLeaks'
complementary
compromises
Control
Pirpi
weeks
discussions
CVE-2016-7836
continued
phishing
chain
Open-source
tried
Army
reunification
Red
OnionDuke
movement
SneakyPastes
US$81
Ministry
ordinarily
MUDDYWATER
28
need
types
June
PNG
type
programming
blocked
drug
Sofacy
cryptology
upcoming
commands;
Uncovered:
(Quasar
definitions
brought
elephant
Netview
errors
pinpoint
GSM
slides
several
Estimating
Leader
internet
BlackEnergy
view
humbler
brings
native
full-featured
leveraged
same
international
attributed
(billUnits
Backdoor.Winnti
(link)
attempted
specially
Persia
studying
Oil
government—commonly
Network
SixLittleMonkeys
scenarios
paved
border
future
remain
Operations'
mimic
BuzzFeed
holding
TidePool
Bittrex
files:Defender.sct
Badnews
associates
Javafog
Moafee
cURL
economic
robberies
Quora
Cleaver
VMProtect;
Bemstour
DLL
cost
55%
Special
developed
managed
outdated
Next
money
fly
inputs
persona
grasp
retailers
job
hunt
update
APT3
longstanding
exist
reveal
configuring
introduced
Finally
validated
anyone
Wh1sks
mitigation
background
DropIt
multiplayer
belonged
surveillance
string
heavily-sanctioned
noting
.wsc
repertoire
most-recent
capturing
Syrian
A
Supervisor
variable
parts
lure
Chronicle
abrupt
How
8
twelve
(if
Text
counteract
indicators
tactics
.xls
gone
agency
living
stub
payouts
pure
NETUI
WebLogic
receive
macros
commonalities
AsyncRAT
Implant
wrong
ethnic
EternalPetya
apparently
Backdoors
SMB
distributing
projects
researcher
e-mail
10:00
.NET
install
exchanges
SQL
Havij
fair
affects
Iron
middle
adopt
victim
sungroup.rar
brief
hijack
0day
decrease
UACME
underground
construction
Canadian
area
ITG08
between
Mimikatz
good
Post
Shortly
goes
1.php
M
Black
aptly
CVE-2018-0798
correlating
shelf
netted
purchased
yet
happens
beyond
Eyes
multilayered
9a
friend
serverSome
institutions
stages
grow
broadly
Ambiguity
manually;
clicking
lengths
pro-democracy
Monitor
Invoke-PSImage
Reaper
modified
retrieving
off
casino
Raymond
complaint
APTs
population
calling
Mohammad
dark
point
keeps
memory
‘Gh0st’
lucrative
Stageless
APT34
Peninsula
Designated
Afghanistan
confidence
broke
mid-2006
gain
AdwindRAT
TFC
45
detailed
CVE-2017-8759
POP3
(via
installed
precautions
client
negotiate
intelligence
post-Soviet
discuss
formation
Nishang
propagation
Buckeye
month
overflow
spraying
mechanism
threads
Animal
(a
red
Dispenser
medical
Chitpas
hopes
evolved
12
Far
interface
2013/2014
combs
profiled
browsed
CVE-2010-2883
can
€13
those
webmail
policy
victim's
Timeline
conclude
Counter
EDT
CVE-2019-0604
versions
determines
PupyRAT
APAC
affinity
‘Decrypt2’
Reconnaissance
China-backed
Slingshot
monitored
drop
function
share
renown
mothership
observe
user
document
debug
Viewer
securing
grants
Canary’s
Malik”
bit
expand
adding
PENCIL
profiling
test.xls
gets
estate/investment
targets—Malaysia
DanderSpritz
running
iPhone's
Antivirus
of—
provisioned
causes
public
N56.15.doc
Vixen
latest
midSeptember
hacks
connects
NetWitness
intense
ultimate
Confucius'
respective
convention
http[:]//mbl[.]shunwang[.]com/cfg/config[.]json”
unseen
preparation.dot
AcrobatUpdate.exe
particularly
properly
fraudulently
HR
quarter
perceived
2018-2019
$300
dismiss
local
Mikrotik
winword.exe
CTU
infrastructures
(objw2180\objh300)
Block
outed
shortcuts
njRAT
activity
AA
Case
1)
telecoms
Though
Foundation
migrant
imaging
RC4-
lacked
SOC
hello.docx
revolving
well-engineered
uninstallers
exact
passed
battery
depending
Termite
ideas
robbers
through
EMEA)
botnets
Around
Gong
(MBR)
agree
sta
Affid
nebulous
scholars
Greece
Adversary
Kyaukphyu
Cutthroat
Agency
indeed
Der
flaws
toolsets
Tor
virtually
C&Cs
followed
calculated
assesses
regrouped
Continued
Kerberos
ToolTo
Umbrella
surfaced
last-stage
LOWBALL
mysterious
conducts
China's
hard-coded
12:15
infiltrate
Powemuddy
First
Filensfer
file-archiving
card
EternalBlue”
Privilege
specifically-crafted
entice
infest
Izz
later-stage
Triconex
Brussels
scams
English-speaking
investigative
consistent
'Improvise'
Tropic
wrote
CVE-2013-5065
Estonia
After
PowerShell-based
languages
RoyalDNS
dumping
interpreted
implant—notable
unsophisticated
total
agents
arriving
agent
witnesses
purposes
gateway
functionalities
segregated
Cobra
Indian
CSS
INTELUPDATE.EXE
encounters
connect
newspapers
EDB's
disclosed
utilizing
arduous
icon
Uzbekistan
Babar
researching
partner
research
massive
tailormade
Office:
earlier
top-level
confirming
branches
FormBook
Buhtrap
Leviathan
mounted
techniquE
2048)
facts
Opsec
chemistry
Elfin
(the
32
encounter
GAMEFISH
Tianjin-based
actors'
investigated
Turla)
‍.
relying
debugging
direct
fingerprinting
18th
northern
institution-specific
stomping
torrent
Minister's
filtering
APT17
RevengeRAT
hospitality
CnC-3
innocent
seriously
sdbinst.exe”
destructive
DEP
first
Downloader.Win32.NetTraveler
threshold
CLI
PSExec
I
models
Silence.MainModule
diagram
ago
Group-IB
government-related
primarily
vested
JHUHUGIT
unique
multi-platform
presidential
runs
dissidents
Near
a42c966e26f3577534d03248551232f3
affairs
2.0
Shadow
Bellingcat
subjects
attributing
enterprise-focused
exclusively
captures
triggers
MitD
Name
attachment
employment
DDKONG
showcase
)used
8080
mules
Group-3390
shortcut
student
Sofacy’s
commonly
integrated
VNC
MH370-themed
Redirection
Tick
302
Co
self-declared
ever-evolving
Let's
evolution
something
gather
not
non-official
Account
confusing
Utah
headline
moment
Julian
following
days
JAR
Right-To-Left-Override
included
TeamSpy
criminals
Logistics
sctrls
actor
nongaming
spied
unanswered
hobbyist
DarkComet
ports
GroupB
Bahrain.
former
APT5
elaborate
bank’s
Services
government-associated
abused
staffs
element
Systems
hypertext
PANDA
obfuscate
committing
randomizing
impersonations
ChopShop1
collective
Qatari
recipient
appends
impersonate
Elderwood
releasing
Deep
ad
Backdoor.Sogu
capabilities
cyber-criminal
targeting
Engineering
navigate
non-public
pop-ups
specialists
approach—one
visibility
HTML
Its
Lambert
Win32/KillDisk.NBO
card-checking
do
PR
needs
persist
Exploitation
lacks
yield
imitate
intensify
at
grab
Elfin)
Unit42
(MSI)
behaviors
Vyacheslav
silently
dllhost.exe
depicted
mostly
paper
Importantly
revealed
presence
SWCs
goal
Commonwealth
MXI
isn't
Leafminer
Oct.
Overlooked
mshta.exe
Skype
Rasoul
EvilGnome
Truvasys
SHAPESHIFT
US-based
bespoke
category
interpret
toolset)
haven’t
late
in-the-wild
pinned
outcomes
geo-targeting
RedLeaves
diplomatic
Pictures
]
off-the-shelf
professional
nothing
Khorasan
GMER
compromising
cybersabotage
2005
Commands
device’s
scanner
cloned
paradoxically
Additionally
options
Razavi
Feb
decoy
sub-domains
powershell-based
allegedly
GYPSY
standards
removable
RootkitRevealer
dumped
combining
Observed
DEĞİŞİKLİĞİ
formerly
FortiGuard
Bangkok
George
spyware
EnableSecurity
houses
sources
shutdown
Assessing
mimikatz
unpacked
tradecraft
like
developers
Yemen
Window
plagued
publisher
terabytes
give
showcases
estimates
CitizenLab
LuckyMouse
Against
late-2017
Yahoyah
Salsa20
board
wiping
logins
Typically
out-of-sequence
unusually
Python-based
prior
willing
blatantly
scanners
playbook
rtegre.exe”
Future
destined
insight
non-governmental
gives
effectively
Automation
AIRBREAK
occurred
British
iPhone
fooled
library
CobaltGoblin
ASLR
restrictive
crew
pictures
eight
parking
begins
Norton
enumerated
mailout
cyberweapons
LATINUM
CVE-2017-0262
VPSs
operator
CnC
logged
Morpho
ongoing
Falcon
CIA's
profilers
Bosnia
mid-2000s
identifications
focuses
elevate
ASP.NET
bright
Lowell
Two
Sednit
workstation
styles
Carbanak
connecting
Create
perspective
layers
jointly
ROCKBOOT
ClearSky
borders
low-volume
Russian-language
hope
Originally
covert
profiler
Electronic
Stylistically
threats
doubled
investments
open-source
authentication
APT41's
PHOREAL
multi-team
meaning
infections
preparing
.ISO
de8a242af3794a8be921df0cfa51885f61
MoneyTaker
withdrawals
acutely
changes
Kimsuky
updater
XLS-withyourface.xls
geographical
RBS
match
navigation
became
both
summer
Taiwan
instructing
Prison
python
characteristics
tools
KOMPROGO
giant—company
repeat
European
MFAs
orchestrator
MOF
proficiency
Blossom
attacking
29
lapse
China’s
ignored
CRASHOVERRIDE
Incompatible
crypto-miners
goals
terms
FrozenCell
Fusion
ears
Trump’s
locations
OfficeServicesStatus.vbs
JBoss
EXE
given
We
listing
000
video
Managed
SAS
frequented
diaspora
)1
News
ransomed
resulting
finder.exe
South
attachés
Fancy
mydomain1110.com
ploy
sez
resources
Collin
CHM
television
determine
campaigning
bot
Encrypt
newly
speaking
credential
odds
curious
self-propagating
shellcode
abovementioned
remember
attacker-controlled
copied
JS/KopiLuwak
eye
values
Un)
Starting
files
Kelihos
credible
USBs
Gazerin
Email
Mac
confirm
KAL’s
Interestingly
Peru
EU
freed
introducing
(ACLs)
Qihoo
Remote
.png
destroy
Strike
companies
Fetch
(MSS)
Suckfly
timely
opponents
OopsIE
WINDSHIELD
proactive
Micro‘s
reputation
insights
Mar
circumstances
old
probable
TERA
Respiratory
e-mails
Solutions
(also
CosmicDuke
simple:
framework
GnatSpy
Emirates
At
presumably
world
unpublished
formats
identify
Group-IB's
less
communication
listen
coded
Brunei
society
IP
Spanish
terribly
Recorded
arbitrarily
HIGHNOON.CLI
preliminary
they
involve
pull
started
Intelligence™
COSEINC
avoid
LUCKY
Reporting
Vietnamese
coherent
hybrid
sponsor
SPIDER
senses
Centeral
EvilGrab
batch
affect
activity:Beacon:
Application
Newscaster
groups—and
classified
nbtscan
Switch
places
poisoned
More_eggs
VPS
Remsec
intercept
Mandiant’s
Trump
crisis
reach
Whenever
ISP
Mofang
analyst
traces
OpenSSH
modernization
screens
DownPaper
formal
simple
counterfeiting
RAM
container
Bike
codebase
multinational
Struts
relays
stolen
PassCV
Victims
constant
PingCastle
profit
indicted
Operator
aspect
preferences
authors
appropriate
2015
Waterbear
commissioned
turned
government-owned
directly
added
openly
Employing
appropriately
Coincidentally
plus
offices
assessments
much
answer
rootkits
AdobeUpdate.exe
marine
Fall
action
Chandashi
Duqu2
medium-high
herein
Gh0st
fetches
Tesla
complexity
doppelganger
deﬁned
securely
Attacks
GET
day
Spot
ReelPhish
FinSpy
think
shipbuilding
macro-based
quite
substantial
We’ve
readily
WriteProcessMemory
Beirut
lending
establishment
Rapid7’s
treasure
(JukeBox)
enter
equipped
Powershell
MiniDuke
BMW_x1”
implement
activated
AutoHotkeyU32.exe
PDF
expensive
ended
ColdFusion
Spider
RATANKBA
PittyTiger
basis
UK-based
Winnti⁶
expansion
patch
(MATI)
institute
registrars
standard
battle
Tribe
per
order
encapsulate
recruiters
in
ten
Turla
joint
Price
metadata
containment
OurMine
Tax
WorldCupSec
configured
directory
briefly
Turkish
cmd.exe
watering
eCommerce
VBE
MyApp
summaries
Russian-
scale
OSB
CVE-2013-3660
resemblance
intent
instructions
purchasing
PwDump6
RunPow
we'll
Pakistan-based
assignments
rockers
siphoned
PDFs
contact
VBS
positioned
inventories
imrsdk.dll
FYP
LEAD
Algeria
+8:30
(SA)
opportunity
patient
transparently
hacked
community
scheduled
Gamma
Backdoor.Remsec
investigation
Donetsk
journalists
Invitation
vendor
BBSRAT
IcedID
BADFLICK
manual
matter-of-factly:
declared
attachments
well-known
Excel
TwoFace
transport
December’s
pirated
Mongolia-focused
encrypted
NetNod
overlapped
production
infests
Worry-Free™
gathering
deceive
Stuxnet
provider
Zebrocy
62
differentand
Some
Pivoting
handling
FireEye
referring
revealing
authorization
ESTABLISHED
CCleaner
Hermes
high-ranking
COMMENT
Rancor
re-used
narratives
Pawn
restaurant
currently
(RaaS)
talks
microcosm
NetTraveler’s
marketing
actor-controlled
Fudpage
step-change
revenue
Kashmiri
ScarCruft
Afterwards
Several
Distinct
There
EmissaryPanda
ASN
Raiu
hallmarks
BokBot
Sectigo
dialogue
outlining
PINCHY
choose
refine
ranges
redactions
SettingContent-ms)
similar
Sun
observing
cross-platform
customize
Japanese-language
alter
foreseeable
posed
Hyok
BiFrost
Fxmsp
ЦНИИХМ
engineering
properties
shed
Consequently
study
80
processes
OLE
Abhay
Bear
Lead
Onion
range
PyCommands
data-gathering
apart
chart
deployments
Tiger
SLOWDRIFT
vertical
Mark
notoriety
them
convenience
(AMSI)
smaller
however
systems
top-of-the-top
Although
extend
functional
facilities
verified
Fri
unveiled
Communist
examines
mails
manpower
write
obviously
Acer
identical
Pyongyang
China-linked
worm-like
uncategorized
assessment:
The
originates
Targeted
details
‘Yokohama’
custom
Devon
surrounding
Large-scale
Evidence
mid-November
bank—in
peer-to-peer
toward
Devoted
amounts
Spam
threatening
intelligence-gathering
Huawei
domforworld.com
budgeting
BalkanDoor
Putin
developing
Double
each
working
focused
examine
simpler
GitHub
network-based
CSEC
reviewed
overarching
corroborate
emergence
Information
ZooPark
America
IWebBrowser2
re-establish
eighteen
determining
originated
aligning
varies
could
combination
upgrading
CVE-2017-0144
shut
state
,2
governments
SMBs
UTF-16
electric
facility
4H
funds
Hop
WinDbg
personas
Residence
Infection
Lynx
assistance
9b
scan-and-exploit
winrar
losses
caution
newsnstat.com
0-day
always
Platform
trusted
demonstrative
reveals
NCKH2.doc
summertime
independent
been
mass-distributed
programs
manipulator
bringing
Barium
file
Blending
RANCOR
advance
Therefore
computer-based
AndroRAT
Cooperation
disposable
criminal
Visma’s
Password
STOLEN
(CVE-2017-0143)
installing
dual
least
clusters
letter
needed
Linux
CFO
sponsors
exﬁltrate
menuPass
$4
commercially
B
recv()
company
Adore-NG
Enfal
cyberespionage
traffic
define
KARAE
responses
favors
loosely
samples
Advpack.dll
plugins
frameworks
Xpert
Minister
Ajax
Shared
coordination
four
group’s
These
recognize
reacted
Korea's
grids
Nadim
big-game
surgical
worksheets
TEMP.Periscope
relentless
in-depth
Buried
Pacha
Democracy
Government-in-Exile
dismal
trove
teams
scan
TA549
focusing
notably
highly
lasted
stranger
rampantly
CSIDL_WINDOWS\debug
to
UK
translates
Donald
verify
indicating
Bin
Per
signature-based
computer
iterations
campaign
operated
Team’s
eCrime
Kazakhstan
this
happened
Southern
peripheral
tricked
Contextually
controlling
GREF
Ryuk
together
version
sensitivity
perpetrate
encryption
Poetry
APT32’s
One
cars
InPage
respect
Mask
alerts
product
West
variants
's
arguments
attach
Equipment
LUNAR
Catchamas
concerted
migrants’
dynamic
high-tech
(probably
International
mode
Recreating
BMW_x8”
NOC
involved
parameters
align
ISMDoor
inward
Falcon®
island
students’
obtain
Subaat
1.1
200
clues
While
Syncopate
attackers’
blew
password-protect
GandCrab
Central
chat
Macfog
demographics
APT34's
Trojan.Naid
spear-fishing
Standard
dns.webswindows.com
banks
12:00
removed
kits
-m
(ANEL)
additional
saw
Jammu
notifies
travelers
human
concern
Pakistani
eleven—had
mining
last
Computer
Symantec’s
SIS
Cys
remote-access
ByeByeShell
NotPetya
lookup
triggered
brick-and-mortar
instill
Record
BEACON
changing
script
installers
130
Sandworm
Adaptor
itself
heavier
Helix
requested
Man-in-the-Disk
chances
intentional
Diebold
e-payment
plague
(CVE-2018-8174)
iSiGHT
DLLs
consolidations
PDB
Serial-over-LAN
mark
reuse
January
reemergence
diplomatic/foreign
transforming
ShadowBrokers
WHITEOUT
Ukranian
informing
JOY
controls
Kingphish
Prior
explicit
sold
add
facade
Immunity
Voiceless
LYCEUM’s
tunneling
poolstr.dll
preexist
learning
hacker-for-hire
corporate
executable)
references
researchers
Silence:
(checker1.exe)
3)
Luhansk
Inspecting
transportation
5.0
15:00
formulas
recover
FIN7
Traditionally
WanaCry
regular
commands
Networks
Jan.
people
graph
distribute
nature
Ansar
Huaying
liquidation
user's
'weapons'
‘Attack
.doc
libraries
none
timesofindiaa.in
know
cards
pharmaceutical
2019
malvertising
numbers
mid-
humanitarian
agencies
ZLAB
considerably
escalating
JavaScript-based
controlled
automating
Citrix
northwestern
passively
exposes
family
(ASA)
insults
luan
NjRat
DeltaCharlie
Immigration
UEC
operates
Today
5)
enhance
Hancom
Caucasus
Most
Interactive
Operation
Pentest
fileless
Technologies
maintain
enabling
APT-C-27
NSA's
books
Gothic
Perhaps
WHOIS
wage
extract
kernel
disable
Alicante
institution
close
Retriever
meticulous
helping
Micro3
Endpoint
geo-location
substitute
cpg
independently
loose
(
(green
categories
platform
resolves
16
ipv4.dll
Bioazih
Nemes
agewkassif
svchost.exe
Vaish
second-stage
Levashov
undertaking
Vevo
fake
carries
guest
spammed
CrowdStrike
Roaming
rabbit
Compromise
Weeping
Authority
Troj/ReRol.A
decade-long
Cross-Site
Windows-based
next
veter1605_MAPS_10cr0.exe”
clinics
LAZARUS
unmentioned
breakthrough
F-Secure
trojans
spread
biotechnology
payloads
well-documented
malicious.exe
Carbon
Flight
Drill
Thanks
seg
Mimic
Front
showing
multi-featured
steadily
maintained
essential
adversaries'
unsuspicious
controllers
registry
9)
applicable
Spy-Net
ccTLDs
thing
Pro-Democracy
Danish
Interface
HackOrges
CVE-2017-0261
links
Empire
attacked
change
Indochinese
154.46.32.129
improved
Recycle
separately
guess
Nidiran
It's
Citadel
Plead
Researchers
terminating
consulates
Congo
non-M
configurations'
ensures
Here
Tajikistan
interacts
3rd
jargon
amount
past
rights
LINE
style
technology
Seeking
Vladimir
detecting
manners
corruption
Office
definitely
Taipei
194.126.10.18
Voice
Iran-based
5.1
appears
volatile
El
Encrypts
NewsBeef's
privatized
assess
Let’s
APT37
n-day
vacancies
TEMP.Zagros
investigating
ScarCruft’s
LinkedIn
Get-LAPSP.ps1
selective
markets
Researching
Component
Pastebin
leader
airline
Past
worth
Magic
flexible
Now
Nitris
ransomware
perpetrated
stage
visitor
packaged
hands
Wikileaks
Pussy
fi"om
anti-forensic
Malaysia
circumventing
notoriously
Henkel’s
against
engine
Lab’s
brute-force
collaboration
prowess
actors’
173.254.236[.]158
executes
report’s
Telecommunications
convoluted
exfiltrating
willingness
factor
time—attackers
disruptive—or
intercepted
112
Single’s
convincing
2007
say
presently
RAT;
interpreter
6th
CyberInt
actually
highlight
monthly
04
Steam
standing
specifics
external
BLACKCOFFEE
In
located
malicious
Strategic
PatchSky
MalumPOS
multitude
some
listed
SKYSEA
thrives
involvement
BeEF
BIFROSE
lifetimes
lightweight
interconnected
part
pay
investment
SWIFT
two
coupled
suggesting
government-affiliated
cu.exe
prepare
artefact
Lamberts
DarkHydrus
adversary
recruitment
perceives
acknowledge
tease
Fresh
victims'
Madcap”
gap
Point
government
Amnesty
lied
consultants
components
Backdoor.APT.PittyTiger1.3
website-based
Amadey
slowly
trait
yielded
notion
matured
compiling
education
Mosquito
evolutions
levels”
shifted
zip
compressed
Consulting
performs
second-generation
levels
manipulating
TRISIS
(CVE-2018-0798)
%TEMP%\flash_update.exe
users’
BARIUM
attacker’s
campaign’s
offered
BalkanRAT
PCShare
injection
one-third
(remote
doubt
hash
ShimRatReporter
Mostly
PowerShower
questionairies
organisations
SecureWorks®
designed
attract
command-line
serious
2004
Sometimes
Industries
regsvr32.exe
increase
Worm”
custom-made
results
reflects
brute-forcing
concept
EvilBunny
belongs
Pink
abstracts
Just
large-sized
RaaS
Times
afterhack
breaches
entire
shifting
full-fledged
craftiness
tens
single-focused
object
creation
cryptocurrency
France
services)
estimate
folders
reasons:Contacts
HackingTeam
CopyPaste”
apparent
pursuit
Guangdong
Confluence
migration
says
fellow
ID
(.chm)
Imminent
winmm
adopted
4:Figure
web-server
testing
nation-states
reports
analytic
speak
performance
executable
introduction
sole
injections
twice
TTF
find
pps
extremely
evidenced
Charming
sponsored
stake
POWRUNER
spans
self-deleting
RATs
TG-0416
CVE-2010-3333
Jerusalem
overseas
informationfrom
stepping
compilation
Go”
2.0:
anti-terrorist
thousands
degree
actual
DanaBot
readme
resourcing
(highest
helps
convince
Code
controversial
natively
APT6
shareholders
Caban
macro-laden
BariumDefendants
welivesecurity
frequently
continually
dub
MARS
intervals
poorly
victima
claim
host-based
ShellExecute()
numerous
Lithuania
SWEED
bash
unchanged
Erebus
Group-2889
straightforward
Duapps
swoop
Silence.
docx
download
taking
Meterpreter
Ratsnif
$3,701,893.98
Interenet
break
beaconing
material
128.127.105.13
Morroco
of
accesses
crackdown
affiliated
extortion
.
zeroing
withdrew
federal
plot
also
hacker
Changer
CVE2017-11882
Syndrome
regime
Ek
Decrypt0r
administrators
TEMP.Veles'
FBI
webpages
kitten
stood
announcement
demand
MagicHound.DropIt
report:
BlueNoroff
22.12.2018
Vietnama's
gangs
cycle
Octopus
labor
highlighted
counterpart
Attachments
ALFA
spearphished
unpacking
stealing
SkyEye
path
hacking
Other
WeChat
implant;
isqlmanager
Vawtrak
resourced
publicly
Ltd
Civil
secret
never
Human
discussion
Drewla
$600
telcos
KEYLIME
performing
SimRatReporter
hot
Such
a??services.exea??
second
Samsung
slew
robbed
company’s
troubleshooting
inter-Korean
wasn't
pasting
everyone
27
ransom
2011
detects
Shamoon
originating
gambling
EternalBlue
Reader
finding
Pitty
SID
Schwarz
war
messaging
beacon
defectors
Crambus
Activity
Sandor
engages
clothing
infect
single
SilverTerrier
RemCom
impacting
hoping
Olympic
wishing
interview
'NavShExt.dll'
Service
Volgmer
Silence’s
tail
globe
Mashhad
strategic
Cadelle
Techniques
two-year
incorporates
pursuing
ther
Framework
Manager
Faso
cron
mix
access
Based
ecosystem
routine
Dukes
WingD
operator(s)
Trooper
businessman
exfiltration
Southeast
.html
Technical
Instead
penetrated
observations
worksheet
group
Lazarus
session
RedDrip
Agriculture
reverse-shell
possession
Ashiyane
financial
dozen
attacker-provided
‘n’)
EDA
rest
PoisonIvy
bugs
Symantec
billing
evolve
complex
resilience
[company]
offering
multi-stage
legislative
AmmyyService.exe
Microsoft
worldwide
economically
pre-set
AZZY
+8
cryptographic
CVE-2014-1776
BKDR_RATANKBA.ZAEL–A
Amazon.com
weighing
elements
3.0
API
nevertheless
Packet
Backdoor.Moudoor
(VirusTotal
Helminth
restrict
anomalous
heavy
simultaneous
Monday
keystrokes
Running
Trojan
70
develops
$88,000
organisation
indications
cash
RC4-encrypted
BlackOasis’
DriverInstallerU.exe”
MNKit
aid
schemes
APT-style
reservation
round
Winnti's
Performance
HANGOVER
Saffron
searched
consolidate
supply
TINYTYPHON
ZeroT
self-install
CyberBerkut
apparatus
APT29
Bank
avoidance
conclusions
Figure
enquiring
fivefold
assign
existed
UPDATESEE
anti-analysis
African
charge
publicly-available
enforcement
concurrent
facilitated
COBRA
modify
Local
succeed
Windows
WScript.exe
PassKillDisk
walked
Uroburos
Orangeworm
SOGU
comparisons
evade
Albania
BeEF-related
Warzone
unobserved
off-therack
since
v1.1
paralleled
loader
geopolitical
explaining
Layout
overlaps
OWA
Waledac
Neutrino
criticism
venture
ASPXTool
POST
Dad
dead
themed
make
toting
2004;
instructed
dedicated
Worm
often
King”
horse
spawning
labour
established
response
talk
foothold
regained
follows
Angel
in-house
Obviously
notifications
Group3
timeline’)
single-factor
ns0.idm.net.lb
SSL
remittance
FireEye’s
roots
Pesce
VPNFilter
Domain
Much
utilization
historic
unsuspecting
bottom
hiding
should
relatively
filter
(CVE-2017-11882)
uncertain
dealing
Teller
UNITEDRAKE
Mia
valuable
seeks
host-enumeration
Donot
NeD
Linux.GreedyAntd
overall
observers
(note
transaction-hijacking
semi-legitimate
low-cost
Accept-Enconding”
Linh
WMIC
explained
wait
European-based
Russian
ways
affiliate
$x
evidence
CVE-2017-10271
DHS
communications
UTC
consumer
preceding
Dragonfly
spree
algorithms
manages
low-key
nonetheless
Spanish-speaking
17:00
configure
GEARSHIFT
issues
implicating
false
18
10
IRIDIUM
C2
logs
pulled
achieved
beacons
displays
attacker
didn’t
participants
Iraq
fearing
Clearly
Manipulator
Master’
consisted
accompanied
scoped
exposé
Inc.
GİB
pro-Russian
Considering
Towards
earth
Moldova
slight
vitae
invoicing
Alternatively
Gholee
hitting
due
caught
software
untagged
requirement
politicians
Lima
mitigations
Madi
delete
conceal
exaggerate
Guard
firewalls
'stolen'
networking
sneak
harddrives
D.l
device
anti-government
Credit
US-CERTs
bitsran.exe
creativity
keen
Attaching
Azerbaijan
forms
key
TLS
Cambodia
Dileep
sought
MadCap
Pichai
crude
marks
leverage
derive
Sasakawa
Instagram®
.LNK
organ
does
timezone
recorded
%APPDATA%
endpoint
Remcos
Systems'
move
aected
tiger
Kaspersky
link
350
trade
overt
Nearly
ANY.RUN
compile
rate
skillfully
Poison
companies'
relations
(SMTP)
groups
BONDUPDATER
uncommon
dates
0
apparel
oil
leaking
73%
XFS
Aviation
wsc.dll”
Meeting
basic
used
harvester
cursory
Persistent
Micro™
vectors
Lim
sidebar.exe
adopting
(Network
civil
announced
Recognizing
throughout
Tibet
continuing
necessary
URIs
upload
wide
DGA
discovered
steals
genuine
error—back
contains
within
sheep
Netwire
adversaries
caused
profiles
staffing
GSD
Interview
simultaneously
RASPITE
consular
multi-billion
assertions
exceeds
infostealers
store
No
media
Protocol
damages
downloads
Sheep’
Iran-nexus
laced
logic)
blog
Targeting
BUTLER
stores
thousands)
preferred
Kong)
$15,000
ASERT
physical
RocketMan!”
Maudi
speculation
BADCALL
(Trojan.Bemstour)
proxy
inserted
intercepts
BCS
swift
Contractors
carried
Presidential
vital
while
hostile
breach
measures
admin@338
intrusive
test
lurk
SPK
protections
extension
Atlantic.net
exceed
unmasked
Daniel
Iranian
Lookout
trading
gas
PyLocky
over
chunk
taint
architecture
resemblances
1.1.1.1
Probably
auto
sessions
Jabber
prominently
speculate
victimology
threaten
news/media
Panda
VBScript
(hostay88@gmail.com
weaponizer
Secure
Kim
All
XP
English
capitalize
identifiers
interrupted
C
Anti-Targeted
why
cited
employee
billing/payment
PC
slide
uninstalls
Patchwork
decrypting
mid-2013s
collect
Potao
Docs
claiming
self-named
consent
Internet-facing
mydomain1607.com
Duke
visage
enSilo
Digicert”
forward
incorporating
masquerades
Thai
sub-botnets
differentiate
PUTTER
Telegram
modus
Azazel
scores
groundwork
Manufacturing
stark
Confucius-related
a.k.a
'Fake-Off'
Kazahkstan
Wingbird
Kitten
virtual
Table
6.0
mentions
Staff
wuaupdt.exe
witnessed
albeit
verb
Province
Xicheng
estimated
unfolded
protect
reserves
ChimayRed
APT19
travel
sub-packages
drawn
scene
Ploutus
Park
APT20
wincex.dll
headquarters
making
warfare
confirmation
Research
frequent
skill
tiered
Explorer
Rich
Binders
self-extractable
any
usuallysee
vast
patches
mitigated
ofthe
Navy
roughly
he
filings
pump-and-dump
privileges
retrieves
24
forensics
Feb.
statement
technically
destructive—event
too
Economy
methods
BAE
christened
Thrip
summarizes
21
see
f-secure
don't
XAgent
restrictions
procedure
aided
stack
Applications
Silence.Downloader
motor
full-time
NoFuserEx
modification
2Version
indirect
Future’s
citizens—journalists
Grey
Believed
mentioned
distinguish
CORESHELL
soon
Jane—that
exceptions
interfaces
Nbtscan
outside
Margarita
read
Persian-language
core
high-technology
nine
NewsBeef
th3bug
demands
invests
cracked
educational
outgoing
GeminiDuke
DYEPACK
oil-producing
CVE-2013-7331
JPCERT
weak
tooling
spam
As
infecting
mathematical
domestic
firms
peninsula
Parliamentarians
System
Practices
Shrouded
primary
hard
special
Encryptor
weaponised
turla
sensitive
(KSN)
continue
Citrix'
cyberattack
methodologies
openings
collection
OverviewFormBook
toolkit
CVE-2012-0158
question
bearing
Unit
gsecdump
headquartered
Symantec's
Brazilian
sip_telephone
Sysinternals
three
place
seek
Despite
chipset
folder
Master
Asia-based
loaders
select
UMBRAGE
Chanitor
weekends
ArYaIeIrAn
360-CERT
engineered
won’t
DIB
RCS
Boyusec
Germany
largely
holdings
Specifically
Lama
worsening
replaced
cells
privacy
geopolitically
funding
operandi
stealthily
Qatar
Dell
app
creative
mainstream
tool)
Guardians
Virginia
siphon
bypass
aimed
(or
whose
spat
arms
chooses
intended
injects
KHRAT
6
header
unknowingly
names
East
26th
concurrently
Lua
kill
subscribed
conduct
chip
fingerprint
pie
certain
intends
divided
Turla-related
keylogging
PLA
Azorult
14-day
commensurate
Custom
ran
CobaltStrike
Cryptologic
asses
diverse
WildFire
paths
tasks
reboots
owners
fan
lid
probability
illicitly
authorities
mission
contribution
Skipper
cmdlet
(legitimate
HWP
self-developed
generalized
ACADEMY
wider
monetize
decryption
immensely
weaknesses
Market
Wikipedia
dropper
mutexes
Auto
zeroday
steganography
Chronicles
hardline
FlawedAmmyy
submits
Western
rose
shows
Confederation
retail
PcClient
news
logging
accessed
DOGCALL
structurally
pair
affair
Africa
coin
division
BADRABBIT
ministry
Tencent
evading
behest
group's
pricing
inicore_v2.3.30.dll
repeated
successors
surprising
Detection
instantiate
Belgium
staff
(C&C)
Chinese-themed
suspect
respects
ShadowPad
entering
far
already-compromised
yahoomail[.]cf
APT-C-26
Defense
capable
Latvia
Baichen
demonstrate
unsuccessful
regarding
correlates
send
switch
republics
APT27
generally
ITSec
collected
ultimately
Trump's_Attack_on_Syria_English.docx”
cyber-sabotage
cities
Division
80%
(shown
ITUC
Feedback
encoding
MSPs
decentralized
Backdoor.Powemuddy
URL
CVE-2018-4878
tactic
Dragos'
would
embassy
Using
Al-Mujahideen
impact
tailoring
breadth
white
It’s
rules
ability
configuration
animation
Meanwhile
defences
invisible
audience
file-transfer
summit
thus
Flamer
organized
mid
dimension
CopyKittens
–
noticeable
infostealer
expanding
develop
LOWELL
Scieron
platforms
argument
registrant
turning
immune
holes
Fatah
text
specialize
(WADA)
v1
digicert-cdn[.]com
software/services
Dining
offline
recording
XMRig
multifactor
readymade
popular
Gelup
narrowly-targeted
‘Operation
name
Crossbow
glance
(ZDI)
advertised
DoublePulsar
w3wp.exe
CVE-2019-1003000
disputes
ChChes
Along
subdirectory
And
get
distributors
anti-targeted
for
PwDump
Amongst
full
concatenated
per-host
CVE-2017-8570
APT30
lost
waited
Task
Machete's
natural
activity—is
hijacking
occasionally
Ransomware-as-a-Service
smuggling
Bitcoin
specializing
COM
skilled
(Reaper):
Bitcoin)
Development
characters’
analyzing
deemed
code
dangerous
charges
1:FireEye
packages
either
tools—remind
templates
circumvent
Retail
Rather
EQNEDT32.EXE
Buckeye's
namely
AutoHotKey
3]
inject.bin
escaping
unauthorized
efficiencies
userinit.exe
look
CROSSWALK.BIN
consistently
Conference
integrity
8:45
things
August
ground
secretaries
Desert
Myanmar
servers
seize
5.2
House
audio
ADORE.XSEC
Permanent
anonymous
stealth
mechanisms
malware-ridden
Entertainment
communities
tweeting
Technitium
(SCT
Samples
Alipay
relied
HTA
competitive
The
Tick)
Take
manufacturer
cryptomining
accessible
wants
system
chose
Link
Sheep’s
BBC
imitating
occasion
top-tier
Data
Antimalware
significant
RIPTIDE
binary
CreateTsMediaAdm.hlp
exemplify
Arabic-language
adobe.com
aka
videos
xman_1365_x
diplomat
Randomization
indicates
(CSRF)
iassvcs.exe
lengthy
published
masqueraded
Group123
declaration
wake
secondary
MyWeb
dubbed
before
record
,
mine
Palestine
reduction
LoJax
penetrating
Nigerian
conducting
control)
specified
burnt
IndiaBravo-PapaAlfa
interacted
When
PowerSploit
subtle
simulating
Machete
keylogger
RGB
4.12”
Wiebo
Used
consolidating
systematically
notices
Dark
Luxembourg
hunting
nexus
SHA256
exercise
Orwell's
DNSMessenger
Governments
short
struggling
remove
Characterized
ccSEUPDT.exe
ICEFOG
potentially
39
nations
chinese
scanning
falsifying
Software
hashes
terminology
TA459
msoffice-cdn.com
On
NSIS
Evil
tailor
Blowfish
obtained
Backdoor.APT.Pgift
POISONPLUG
Turk
unit
webservers
biography
Atlas
available
BEAR
surfacing
entity
Interbank
bug
CVE-2015-2546
X
BISCUIT
Bisonal
Omsk
traditional
WinUtils
20150920
forwarding
Authenticode-signing
newest
CVE-2013-0640
cell
around
Marina
NUMBERED
gaming
53
heist
2001
darkside
spend
Frank
suggested
Sarhust
delves
Marvel
148.251.55.114
POWBAT
Working
Crackmapexec
transactions
sale
installs
CERT
task
periods
am
lists
uncertainties
decrypt
statistics
Wizard
anticorruption
consequence
KSN
inbound
benefitting
extracts
3390
Format
disguising
entitlement-based
embarrass
origin
Fxmps'
Lee
produced
Scripting
increasing
counterfeit
figures
explorer.exe
applied
flare-qdb
hotel’s
prevented
Pony
Testador
dealer
Defendants
Bluetooth
Republic
HIDDEN
contractors
privileged
widespread
dropping
Ext_server_extapi.x64.dll”
103.236.150.14
domains
motherboards
Ploutus-D
(CCI)
present
ANEL
JEEPFLEA
new
Group
'EQNEDT32.exe'
minor
masquerade
Inc
(14.5%)
organization’s
repository
Android
XBOW
Oracle
time
Microsoft’s
currency
warning
try
reverse-engineering
leaked
5000
purported
supports
SNEEPY/BYEBYESHELL
risk
then-unpatched
now
Dridex
socially
academia
claimed
base
Mandianta
thorough
dabbled
one
attacks—such
descriptions
statesponsored
BITSAdmin
online
decoded
High-Tech
SamSam
intruders
CVE-2015-5119
forecast
lake
2000s
Southeastern
Decoys
histories
jump
worn
feedback
blogposts
ceased
best
en
TG-3390
exempts
basically
hex-encoded
Canhadr/Ndriver
queue
lie
(EOP)
1
defend
establish
Cold
incoming
G20
better
call
Address
Regardless
LookingGlass
Request
long-running
(wmiApSrv)
reached
greensky27.vicp.net
typosquatted
Intel
Silence’
Muddywater
outset
activist
Sheep
PoSeidon
growth
according
applications
effective
Hydra
delivered
spanning
judge
dumpers
RUHAPPY
intelreports@kaspersky.com)
and/or
Incident
loss
cast
STAR
Almost
naming
CT
compiler
created
32-bit
implicated
Xiaomi
reduce
knowledge
course
Avast
xxmm
filenames
mouth
carry
polymorphic
prey
shouldn’t
Deputy
Smoke
fieldwork
Amazon’s
Directorate
load
routes
history
colleges
Store
general-purpose
purport
proxies
selling
ATR
firewall
Coast
term
diverged
largest
Backdoor.Hikit
Illinois
mindset
SDK
COBALT
Waizsar
blocks
moderate
CST
XML
infectors
staged
Anti-drop
air
HackingTeam's
but
McUpdate.dll
exfiltrates
central
Seven
floods
Hound
Player
Kenya
Hopper”
PICKPOCKET
two-phase
updated
Kong-based
section
PwC
handler
DeputyDog
GRIFFON
whitepaper
Mexico
password-protected
simulate
timestamp
(SQLi)
78020
issuing
subordinate
Ammy
Baidu
extent
.NET/MSIL
accounted
By
person
repeatedly
alone
EK
Operating
corroborated
concludes
meek
Krotofil
iPhones
Appendix
Bookworm
design
down
submission
be
CVE-2014-6352
searching
turbines
Space
provisioning
licenses
preexisting
impactful
neutralize
government-directed
avionics
beachhead
customized
PoS
possible
minutes
54
Controller
Rose
(FaaS)
Excel/Word
Kaspersky's
ConfuserEx
concerning
potential
periodic
Cybereason
lesser
ThreadKit
resolver
big
buffer
personal
seemingly
ISIGHT
Snake
monitoring
uninteresting
Turla’s
CVE-2015-2545
generates
doesn’t
analytical
Shun
(CVE-2019-0703)
hours
PCAP
deployed
Swallowtail
expense
responsibility
Magic
gift
consider
attracted
well-tailored
Elirks
up
Spiegel
banks'
Proofpoint
quick
where
Existing
western
Korean-language
certificates
invoice
Win32/Potao
APT2
tracks
Arbor
DarkHotel
intermediate
cleared
incorporated
Unlike
plotting
AmmyAdmin
Haaretz
mid-2018
eastern
Ismdoor
enticing
persons
Also
today’s
VAMP
Chinese-affiliated
missions
philosophical
MD5
(MDB)
activators”
-
government-grade
pass-the-hash
But
Ham
Hellsing
cyber-attacks
mid-January
Lab
abuse
idiosyncrasies
complicated
HaoBao
cyberattacks
registering
chats
actionable
whom
aggression
CopyKittens2
scheme
system's
Dining'
class
ATM
relationship
as-is
‘Donot’
GlobeImporter
reselling
depth
OSX
semiconductors
reliance
Xbash
originate
requires
Malefactors
Sublime
including:
Palo
jquerycodedownload.live/check.aspx”
rollback
cases
Smart
reside
'JQJIMPROVISE'
Depriz
contract
databases
registries
opposed
XOR
Fateh
his
ancient
ISAPI
AppLocker
CVE-2016-0189
SYSCON
feature
PowerShell-enabled
front
dispensing
PayPal
women
possibilities
Visual
Somalia
fell
Backdoor.Remexi.B
(DHS)
BitPaymer
familiarity
identified
DTI
classify
dynamic-DNS
analyzes
motivated
custom-built
TEMP
security
learn
circulate
HIGHTIDE
CVE-2012-4681
Xagent
unnamed
thereby
CottonCastle
RMS”
apps
regulatory
5.3
advocates
sphere
Documents
Loaders
Since
covered
Choopa
groups.10,11
WebDAV
inevitably
bore
police
use
back
few
actor’s
dozens
first-
Utilizing
reasonable
computers
fast
(and
Once
OutExtra.exe
information-gathering
XAGENT.B
(AIX)
NanHaiShu
inadvertently
saving
Komplex
produce
game”
uploads
deactivate
maximize
08:00
fetch
post-infection
CreateRemoteThread
20150905
using
Kurdish
correlation
sticks
slow
span
Dropbox
setup.exe
may
list
rolled
Britain
Cylance
gup.exe
enabled
Intezer
compress
PLEAD
FakeTLS
responsible
sustained
IBM
during
Moreover
BTC
Myanmara
efforts
Win32/FakeTC
SHIRIME
retooled
in—the
Cymmetria
desire
labs
(renamed
SOURFACE
Worldwide
(APT)
classic
decision
adheres
ADVSTORESHELL
INF
Explicit
along
Magnitude
press
Interior
lures
NHS
Indicators
gaining
Monsoon
upload.bat
onto
Netherlands
variety
solid
PYTHON33.hlp
correlate
(e228045ef57fb8cc1226b62ada7eee9b)
Kridakon
providing
misused
spreading
communicate
Perl
I'm
Written
value
screen…
self-registered
trick
script-based
viruses
NGO
Project
protected
valid
nonfunctional
Royal
ccSEUPDT.exe.”
(MSPs)
balance
backwards
Entities
standardization
Since
Notepad++
Automated
ICAO
(.wiz)
cease
contrary
include:AIRBREAK:
behave
delegitimize
credentials
detection
Putty
invoke
info-stealing
visitors
persuade
pursued
c:\temp\rr.exe
%TEMP%
elusive
Airlines
Speed
Anunak
returns
disappeared
file-executing
capital
units
Flying
a7
acts
defector
when
went
only
ﬁles
www.flymna.com
sign
investigations
(Bartender)
toolset
GÖRÜŞÜ.doc”
turns
finally
Unfortunately
recruitment-themed
promising
IIS
+
Known
(as
receives
unacev2
services.BADFLICK:
DOCM
scheduler
Core
commercially-available
IndigoZebra
limitedly
improve
Scout
variations
language
VirusTotal
solutions
it
corresponding
Objective-See
hypothetically
threat
Chopper
aviation-related
Holiness
thwart
notaries
TRINITY
Ivy-based
Talos
launches
somewhat
harvests
DanBot
believes
Trade
WanaCryptor
bids
APT18
actor-registered
Montenegrin
put
PythocyDbg
adapted
early-2015
malware-less
Scanner
AWS
side
Turkey
lineage
registered
faux
May
Instruments
behavioural
ITSEC
spreads
—have
freshly
Shell
PeddleCheap
writers
opportunistic
VPN
loading
fate
Gaza
onward
recompiled
(MD5
six
GhostSecret
keychain
occasions
United
decoys
enumerate
click
ppsx
newspaper
module
immediate
agenda
merit
22
tapped
AdroMut
2)
SYSTEMTEN
PYTHON33.dll
deleted
researches
attacks’
NetTraveler
SOUNDBITE
asia
majority
free
market
promoting
disguise
acceptable
ined
devices
sideloaded
Note
CPE
excellently
bypassing
motivation
U.K.
(MERS)
specifically
Citizenship
outbound
2018-10-29)
issue
exfiltrated
eager
manage
Moniker
App
EastNets
CozyDuke
Institute
decode
VALUEVAULT
portion
stand
strange
greater
hidden
SCT
embedding
APT38
tends
61398
stealer
Cloud
shadows
meeting
generation
ICS-Forth
View
reality
ﬁleless
ChinaChopper
sector
PIVY
Exchange
successfully
Join
establishing
well-funded
Atomic
procedures
Aurora
(maintaining
commodities
JScript
solely
parties
shot
customers
(FLARE)
Resources—on
deobfuscate
high-return
fleets
Google
RAR
Quasar
patterns
APT10-related
deeper
RSA
Londhe
success
individual
analytics
Proxysvc
tester
featured
rival)
various
Defender
empty
rudimentary
PCAD
circulation
characters
CVE-2014-0160
trigger
rely
understand
approach
Slack
MS07-010
dated
forums
ported
$832k
macOS
flowInfection
describes
grateful
Chile
Zuckerberg
CMD.EXE
avoiding
radio
assessed
opening
encompassed
significantly
researched
maintaining
brazen
Further
Iran
Waterbug
sic
instructs
charts
currencies
Palestinian
OceanLotus
financially
copy-and-paste
editing
codenamed
Neodymium
PHOTO
mitigate
WMImplant
Mobile’s
(contact
ccTLD
.DLL
logger
subsequent
Aerospace/Defense
register
considers
politically
life
apks
addition
source
Facebook®
Siemens
APT1
fact
TXT
Portal
instrumental
e-commerce
Threatpost
MagicCoder
proving
semiconductor
symptom
trojan
employee’s
classes
RTM
ZINC
netstat
fallen
obfuscation
accordingly
MyDoom
routinely
partnership
car
manual.doc
Spy
took
subsided
example
supported
Canary
records
invitation
illustrates
AutoFocus
Depending
Discovery™
meet
STRAITBIZARRE
times
xlsm
demonstrates
Compromises
matter
MI5/BTSS
operate
analyze
hacktool
resembles
reassemble
Pinchy
Staging
medium
Python
selected
cooperation
safety
monetary
geolocation
$200,000
operators
novel
ones
flagged
Kit
Bugat
Federation
tie
IR
Exploit.MSWord.CVE-2010-333
large-scale
detected;
sort
confidently
package
selection
SMBv1
advisory
iSIGHT
MONSOON
relaying
thereafter
kit
Hats
NCC
adversary-controlled
visiting
installer
spear
theme
Government
EMV
FANCY
Ghost
VLC)
settings
HyperBro
panel
particular
involving
join
establishes
Dubai
/
whatever
CVE-2018-8174
keyboard
(RTF)
Thu
Austria
receipts
(EternalBlue)
lowered
Developmentdepartments
proven
waterhole
low
Batmobi
MAC
KXCashDispenserLib”
Extension
They
addresses
Egypt
Maldives
TechNet
c.exe”)
request.docx
clandestine
ROKRAT
Gozi
iOS
CD
packets
practice
However
firmware
method
MSIL
Tant
unidentified
summary
healthcare
protecting
Advanced
Confirmation
stating
statements
opinion
Gray
Composite
identification
removal
petrochemical
anti-emulation
Herbert
443
us
LeT
SEDNIT
MySIGHT
custom-tailored
decided
Outlook
Dino
Europol
Union)
covertly
flavors
An
Arabic-speaking
G
option
Vector
warned
Chinese
compared
Quite
experienced
unification
compromised
Hamilton
C#
indiscriminately
Chrome
e-currency
political
http://analytics-google.org:69/Check.aspx
downloaded
Activists
decryptors
hashing
refers
EmpireMonkey
recon
factors
ServHelper
Intercept
MSP
Dec
cleanup
hostname
Organizations
hacktools
APT-C-35)
pointed
Subsequently
with
eye-watch.in
World
boutique
transitioned
Pyongyang-affiliated
management
today
little
Torn
Trojan.Imecab
telephone
Goldmouse
trying
retired
lay
sharing
silent
itineraries
likelihood
exit.exe”
storage
keys
assistants
nodes
EHDevel
MagicHound.Rollover
what
RTF
raw
organization's
prioritized
Ext_server_espia.x64.dll”
additions
by
configures
existence
control
skimming
workstations
write-up
aggressive
TA17-117A
Micro’s
mass
talking
reason
terminal
manoeuvre
functionality
GD
remotely
SeaDuke
CVNX
Payflow
Pascal
referenced
plain
exclusive
KerrDown
POC
double
scientific
Latin
defeated
DYMALLOY
antivirus
classical
likely
Github
above
Security
unearthed
Nitro
zlib
observed
codesigning
context
Turkey-based
findings
mapping
recommends
distributed
TClient
ambitious
buzzword
belief
wave
Sierra
occurring
GROUP
Olympics-themed
journalist
3PARA
released
relative
annual
she
AutoHotkey
environment
Citrix-hosted
Bienvenue_a_Sahaja_Yoga_Toulouse.doc
provision
(libcurl.dll)
towards
sample)
apply
Cocoa
capture
IXESHE
RAKBANK
Bangladesh
SFX
&mdsh;
exectuables
Uganda
checkout
Cloackman
Analytics
Version
CVE-2016-0147
many
though
retrieve
preferring
Nigeria
MACKTRUCK
outlook.live.com”
predominantly
privilege
couple
radically
Nevertheless
Laoying
bodies
brewery
analyzed
expect
disposal
cyberattackers
Bat!
Tue
NjRAT
Banker
formats.”
soviet
exchange
subsidiaries
Croatia
Brokers'
TEMP.Hermit
attacks—which
contacted
done
ASA
CVE-2017-0199
eventually
play
MUSTANG
failed
motives
MuddyWater's
Indeed
heard
builds
crafted
Dexbia
fuller-featured
Evin
FlexiSPY
Truth
KiloAlfa
00002
modules
satellite
Harvested
CVE-2019-0752
million
Oman
URLs
opportunistically
Venezuelan
Metasploit
varying
Beyond
immediately
categorize
unknown
Georgia
military
succeeded
Whitefly
User
iPads
Xinjiang
worm
causation
185.162.235.0/24
blobs
purchases
meta
(CPE)
prominence
pngdowner
Furthermore
APT32
Team)
opted
wiser
partnerships
publicly-facing
has
zero-days
Damage
What
implementation
it's
resilient
stated
appearing
Tracking
SLUB
reported
PostScript
cybergang
seven
PlugX
Surveillance-As-A-Service
familiar
Nathan
layer
useful
—
executed
theory
sales
transferring
CVE
constantly
progressively
WMI
Zirconium
virulence
care
dissemination
energy
narrative
OceanLotus's
limiting
Three
Putter
check-in
legal
initiated
religious
effortto
leading
NetWire
[username]=>singleton-instance-mutex
monitors
.wav
protesters
confusion
TRITON’s
Thailand
city
elsewhere
QQ
Kalignite
Shin-Etsu
deep
very
average
hour
embedded
governmental
our
makecab.exe
expertise
customer
asesses
Business
rapport
confrontation
APT15
Parliamentarian
Hetzner
(formerly
below
formally
belong
shining
opportunities
responded
ASUS
rar.exe”
positively
heiress
University
POSHSPY
Explanation
exit
Bariumused
.tmp
Hunter
filed
About
Gang
gave
automate
varied
Simulations
importance
forced
Ukrainian
Anchor
Drive
26
C2s
Iranian-American
Cannon
;
Johnson
ahead
(RMS)
Moving
Mali
enable
SecurityLabs
BS2005
r.exe
lines
sophistication)
written
pivoting
PittyTigerV1.0
CVE-2015-2590
composed
bring
itself)
phonetic
Update
equips
loader’s
net
piece
haven't
participation
Vietnam
eleven
Kharkiv
exchanging
observation
ciphers
noticeably
FinFisher
focus
Destructive
gsecudmp
Numerous
found
IOS_
arm
zero
SIGHT
SmeshApp
Nordic
infpub.dat
Pro
victims’
chemical
APT’s
proceeded
party
(.sa)
Anderson
strategy
InstallUtiil.exe
phases
MH370
contractor
Jripbot
unless
Waterbug-linked
